from moria.functions import happy_end


def chapter3():
    print("Вы вышли в правый корридор. Прошли по нему и попали в большой темный зал.")
    print('''В стенах было высечено множество ниш, а в них - большие деревянные сундуки, обитые железом. Все они
были разбиты, рядом с расколотой крышкой одного из них лежали остатки книги.Она была разрезана,
пронзена саблей, частично сгорела и была так выпачкана темными пятнами, похожими на засохшую кровь,
что мало что можно было прочесть.Гэндальф осторожно поднял ее, но листы трещали и ломались,
когда он положил книгу на плиту.Некоторое время маг изучал книгу, не говоря ни слова.Фродо и Гимли,
стоявшие с ним рядом, видели, как он бережно перелистывая страницы, исписанные рунами множеством
разных почерков.Использовались руны как Мории, так и Дейла, а время от времени встречались и
эльфийские знаки.  Наконец Гэндальф поднял голову.  - Похоже, что это записи о судьбе народа Балина,
- сказал он. - Они начинаются от прибытия в долину Димрилла около тридцати лет назад, большинство
страниц относится к первым годам после их прибытия. Верхняя страница имеет обозначение "1.3",
так что по крайней мере два листа с начала утрачены.''')
    print("Это дневник Дурина, в нем он описал осадцу и падения Кхазад-Дум темнымми силами. "
          "Поздравляю, вы нашли настоящее сокровище, экземпляр романской письменности IXIIX века.")
    print("Теперь, с этой рукописью, вы богаты!")

    happy_end()

